cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/x11'
tap 'motemen/ghq'

# install tools & utilities
brew 'aircrack-ng'
brew 'ansible'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'bchunk'
brew 'binutils'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'gawk'
brew 'ghq'
brew 'git'
brew 'global', args: ['with-exuberant-ctags', 'with-pygments']
brew 'gnu-sed'
brew 'graphviz'
brew 'hugo'
brew 'jq'
brew 'mas'
brew 'nkf'
brew 'nmap'
brew 'openssl'
brew 'peco'
brew 'plantuml'
brew 'pngquant'
brew 'pstree'
brew 'socat'
brew 'the_silver_searcher'
brew 'tig'
brew 'tree'
brew 'vim', args: ['with-lua']
brew 'wget'
brew 'wireshark'
brew 'xz'
brew 'youtube-dl'
brew 'zsh'

# install middlewares
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# programming languages & frameworks
brew 'go'
brew 'lua'
brew 'luajit'
brew 'node'
brew 'python'
brew 'pyenv-virtualenv'
brew 'scala'
brew 'sbt'
brew 'typesafe-activator'

# install applications
cask 'java' unless system '/usr/libexec/java_home --failfast'

mas '1Password',                id: 443987910
mas 'Caffeine',                 id: 411246225
mas 'FreeMan',                  id: 510934532
mas 'ForkLift',                 id: 412448059
mas 'JPEGmini',                 id: 498944723
mas 'Microsoft Remote Desktop', id: 715768417
mas 'The Unarchiver',           id: 425424353
