cask_args appdir: '/Applications'

# install tools & utilities
brew 'aircrack-ng'
brew 'ansible'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'binutils'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'gawk'
brew 'ghq'
brew 'git'
brew 'global'
brew 'gnu-sed'
brew 'graphviz'
brew 'hugo'
brew 'jq'
brew 'mas'
brew 'nkf'
brew 'nmap'
brew 'openssl'
brew 'peco'
brew 'plantuml'
brew 'pngquant'
brew 'pstree'
brew 'socat'
brew 'the_silver_searcher'
brew 'tig'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'wireshark'
brew 'xz'
brew 'youtube-dl'
brew 'zsh'

# install middlewares
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# programming languages & frameworks
brew 'go'
brew 'lua'
brew 'luajit'
brew 'node'
brew 'python'
brew 'pyenv-virtualenv'

# install applications
cask 'java' unless system '/usr/libexec/java_home --failfast'
