cask_args appdir: '/Applications'

# install tools & utilities
brew 'aria2'
brew 'ansible'
brew 'azure-cli'
brew 'awscli'
brew 'coreutils'
brew 'ffmpeg'
brew 'fontconfig'
brew 'freetype'
brew 'gawk'
brew 'ghq'
brew 'git'
brew 'global'
brew 'gnu-sed'
brew 'graphviz'
brew 'imagemagick'
brew 'jq'
brew 'nkf'
brew 'nmap'
brew 'openssl'
brew 'peco'
brew 'plantuml'
brew 'pngquant'
brew 'pstree'
brew 'rename'
brew 'socat'
brew 'telnet'
brew 'tig'
brew 'tree'
brew 'universal-ctags'
brew 'vim'
brew 'wget'
brew 'yt-dlp'
brew 'zsh'

brew 'aircrack-ng'
brew 'fcrackzip'
brew 'mupdf-tools'
brew 'qpdf'
brew 'wireshark'

# install middlewares
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'sqlite'

# programming languages & frameworks
brew 'go'
brew 'lua'
brew 'luajit'
brew 'node'
brew 'python'
brew 'pyenv-virtualenv'
